In [2]:
import pandas as pd

In [3]:
data = {
'Year': [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014],
'Population (m)': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
'Temp': [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
'GDP': [60.6, 59.9, 59.3, 58.7, 58.0, 57.4, 56.8, 56.1]
}
df = pd.DataFrame(data)
df

   Year  Population (m)  Temp   GDP
0  2021            33.9  1.54  60.6
1  2020            33.5  1.48  59.9
2  2019            32.9  1.56  59.3
3  2018            32.5  1.62  58.7
4  2017            31.9  1.65  58.0
5  2016            31.4  1.66  57.4
6  2015            30.9  1.64  56.8
7  2014            28.5  1.53  56.1

In [20]:
data = {
    'Uzbekistan': {2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9, 2016:31.4, 2015:30.9, 2014:28.5},
    'Kazakhstan': {2021:18.8, 2020:18.5, 2019:18.3, 2018:18.1, 2017:17.9, 2016:17.7, 2015:17.5, 2014:17.3, 2013:17.1},
}

df2 = pd.DataFrame(data)
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.8
2020        33.5        18.5
2019        32.9        18.3
2018        32.5        18.1
2017        31.9        17.9
2016        31.4        17.7
2015        30.9        17.5
2014        28.5        17.3
2013         NaN        17.1

In [12]:
df2.index.name = 'Year'
df2

      Uzbekistan  Kazakhstan
Year
2021        33.9        18.8
2020        33.5        18.5
2019        32.9        18.3
2018        32.5        18.1
2017        31.9        17.9
2016        31.4        17.7
2015        30.9        17.5
2014        28.5        17.3
2013         NaN        17.1

In [13]:
df2 = pd.DataFrame(data, index=[2021, 2019, 2017])
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.8
2019        32.9        18.3
2017        31.9        17.9

In [14]:
df2.T

            2021  2019  2017
Uzbekistan  33.9  32.9  31.9
Kazakhstan  18.8  18.3  17.9

In [16]:
df2.values

array([[33.9, 18.8],
       [32.9, 18.3],
       [31.9, 17.9]])

In [17]:
arr = df2.values
arr

array([[33.9, 18.8],
       [32.9, 18.3],
       [31.9, 17.9]])

In [18]:
type(arr)

numpy.ndarray